> Calling Openshift specific APIs will be out of scope for this plugin.
I understand

> However you can still use this plugin to use the namespaces, aka projects, created by the oc commands. e.g.
No. I tried to deploy [examples/nginx](https://github.com/mingfang/terraform-k8s-modules/tree/master/examples/nginx) and it fails if the token used in kubeconfig is not cluster-admin

I then tried to create the 'nginx-example' namespace using *oc* client and then run *terraform apply* but is tries to create or update the namespace which fails.

```
Terraform will perform the following actions:

  # k8s_core_v1_namespace.this will be created
  + resource "k8s_core_v1_namespace" "this" {
      + id = (known after apply)

      + metadata {
          + annotations                   = (known after apply)
          + creation_timestamp            = (known after apply)
          + deletion_grace_period_seconds = (known after apply)
          + deletion_timestamp            = (known after apply)
          + labels                        = {
              + "istio-injection" = "disabled"
            }
          + name                          = "nginx-example"
          + namespace                     = (known after apply)
          + resource_version              = (known after apply)
          + self_link                     = (known after apply)
          + uid                           = (known after apply)
        }

      + spec {}
    }

  # k8s_extensions_v1beta1_ingress.nginx will be created
...
...
```

So unfortunately none of your examples creating namespace work '*as-is*' on OpenShift with regular user.